In [1]:
import pandas as pd

In [20]:
df = pd.read_csv('sample.csv')
df.head()

           name  population  area
Osaka     2691k         223   NaN
Nara       353k         276   NaN
Kyoto     1472k         827   NaN
Koube     1542k         552   NaN
Wakayama   355k         208   NaN

In [21]:
df2 = pd.read_csv('sample.csv')
df2.head()

       name population  area  Unnamed: 3
0     Osaka      2691k   223         NaN
1      Nara       353k   276         NaN
2     Kyoto      1472k   827         NaN
3     Koube      1542k   552         NaN
4  Wakayama       355k   208         NaN

In [18]:
df2 = pd.read_csv('sample.tsv',sep='\t')

In [19]:
df2.head()

     name    population  area
0        Osaka   2691k   223
1      Nara    353k    276
2        Kyoto   1472k   827
3          Koube   1542k 552
4  Wakayama    355k    208